ЧартерEDT.Расширение1/src/Documents/чартер_ЗаписьНаРейс/чартер_ЗаписьНаРейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>чартер_ЗаписьНаРейс</name>
  <registerRecords>InformationRegister.чартер_ЗаписьНаРейс</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.чартер_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.чартер_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.чартер_Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОАнглийское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричиныВылета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SLIP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКакойНОТеЗаявлены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусНаРейсе</name>
    <type>
      <types>EnumRef.чартер_СтатусыНаРейсе</types>
    </type>
  </attributes>
  <attributes>
    <name>Место</name>
    <type>
      <types>CatalogRef.чартер_ПосадочныеМестаНаРейс</types>
    </type>
  </attributes>
  <attributes>
    <name>СКемПосадить</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйБагаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

ЧартерEDT.Расширение1/src/Catalogs/чартер_ПосадочныеМестаНаРейс/чартер_ПосадочныеМестаНаРейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>чартер_ПосадочныеМестаНаРейс</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Класс</name>
    <type>
      <types>EnumRef.чартер_КлассыМестВС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнфоСообщение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнфоАктивно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпоновкаВС</name>
    <type>
      <types>EnumRef.чартер_ТипВСРассадка</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЧартерEDT.Расширение1/src/Documents/чартер_ЗаписьНаРейс/Forms/ФормаПодбораМеста/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры);		
	
	СхемаРассадки.Очистить(); 
	МакетРассадки = ПолучитьМакетРассадки();
	ОбластьБизнесКласс = чартеры_ОбщиеПроцедурыИФункцииСервер.ЭтоАктуальнаяБроньНаРейс(Объект.Рейс, МакетРассадки
																									, "ПосадочныеМеста");
	СхемаРассадки.Вывести(ОбластьБизнесКласс);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Забронировать(Команда)
	
	ПараметрыБронирования = Новый Структура("Место", Объект.Место);
	ОповеститьОВыборе(ПараметрыБронирования);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Procedure СхемаРассадкиТДOnActivateArea(Item)

	ВыделенныеДанные = СхемаРассадки.SelectedAreas[0].Text;  
		
	Если НЕ ВыделенныеДанные = "" Тогда
				
		МестоСотрудника = ПолучитьМестоДляСотрудника(ВыделенныеДанные);
		Если МестоСотрудника = Неопределено Тогда
			чартер_ОбщиеПроцедурыИфункцииКлиент.СообщитьПользователю("Выбранного места нет в справочнике, 
			|																		необходимо завести его карточку.");
			Возврат;
		Иначе	
			Если МестоСотрудника.ИнфоАктивно Тогда			
				СтрокаСообщения = Новый ФорматированнаяСтрока(МестоСотрудника.ИнфоСообщение);
				ОписаниеОповещения = Новый ОписаниеОповещения("ПредупреждениеЗавершение", ЭтотОбъект);
				ПоказатьПредупреждение(ОписаниеОповещения, СтрокаСообщения);
			КонецЕсли;
		
			ЭтоМестоСвободно = ПроверитьДоступностьБрони(МестоСотрудника.НомерМеста);
			Если ЭтоМестоСвободно Тогда
				Объект.Место = МестоСотрудника.НомерМеста;
				ОбновитьРассадку(ВыделенныеДанные);
			Иначе
				чартеры_ОбщиеПроцедурыИФункцииСервер.СообщитьПользователю("Выбранное место не доступно для брони!");				
			КонецЕсли;			
		КонецЕсли;
		
	КонецЕсли;   

EndProcedure     

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПредупреждениеЗавершение(Параметры) Экспорт
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьМакетРассадки()
	
	Возврат чартеры_ОбщиеПроцедурыИФункцииСервер.ПолучитьМакетРассадки(Объект.рейс);
		
КонецФункции

&НаСервере
Функция ПолучитьМестоДляСотрудника(ВыделенныеДанные)
	
	КомпоновкаРейса = ПолучитьКомпоновкуРейса();
	Возврат Справочники.чартер_ПосадочныеМестаНаРейс.ПолучитьПосадочноеМесто(ВыделенныеДанные, КомпоновкаРейса);
	
КонецФункции

&НаСервере
Функция ПолучитьКомпоновкуРейса()
	
	Возврат Справочники.чартер_Рейсы.ПолучитьКомпоновкуРейса(Объект.Рейс);
	
КонецФункции

&НаСервере
Процедура ОбновитьРассадку(ЗабронированноеМесто)

	СхемаРассадки.Очистить();  	
	
	МакетРассадки = ПолучитьМакетРассадки();
	ОбластьБизнесКласс = чартеры_ОбщиеПроцедурыИФункцииСервер.ЭтоАктуальнаяБроньНаРейс(Объект.Рейс, МакетРассадки
																								, "ПосадочныеМеста");	
    	
	БронируемоеМесто = ОбластьБизнесКласс.НайтиТекст(ЗабронированноеМесто);
	Если БронируемоеМесто.Text = ЗабронированноеМесто Тогда
		ОбластьБизнесКласс.Область(БронируемоеМесто.Name).BackColor = WebЦвета.Лосось;
	КонецЕсли;	
		
	СхемаРассадки.Вывести(ОбластьБизнесКласс);
		
КонецПроцедуры 

&НаСервере
Функция ПроверитьДоступностьБрони(МестоСотрудника)

	Возврат чартеры_ОбщиеПроцедурыИФункцииСервер.ПроверитьДоступностьБрони(Объект.Рейс, МестоСотрудника);
	
КонецФункции

&НаСервере
Функция ЭтоЗабронированныеМеста()
	
	Возврат чартеры_ОбщиеПроцедурыИФункцииСервер.ЭтоЗабронированныеМеста(Объект.Рейс);	
	
КонецФункции

#КонецОбласти
